## Problem

In [3]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline

# to display the total number columns present in the dataset
pd.set_option('display.max_columns', None)

In [4]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']});

In [5]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
df["FlightNumber"].isnull().sum()

2

## 1- Fill missing flight number

In [5]:
df.FlightNumber = df.FlightNumber.interpolate()

In [120]:
## another stupid way
df["FlightNumber"]= [10045+(10*i) for i in range(0,5)]

In [121]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

## 2- Split From to in different columns

In [10]:
#temp =df["From_To"].apply(lambda x : pd.Series(x.split("_")))
temp=pd.DataFrame()
##another way
temp[["From","To"]] = df.From_To.str.split("_",expand=True)

In [11]:
temp.columns=["From", "To"]
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

## 3- Capitalize word

In [12]:
temp = temp.loc[:,["From","To"]].apply(lambda x : [i.capitalize() for i in x] ) ## for multiple coulmn
## see selecting multiple column in dataframe
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

## 4 - Delete from to and concat temp dataframe

In [18]:
df = pd.concat([df,temp], axis=1)

In [19]:
df.drop("From_To", axis=1, inplace=True)

In [20]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

## 5- Delay in diff columns

In [21]:
df["RecentDelays"].apply(lambda x1:print(x1))

[23, 47]
[]
[24, 43, 87]
[13]
[67, 32]

0    None
1    None
2    None
3    None
4    None
Name: RecentDelays, dtype: object

In [22]:
rd=pd.DataFrame(list(newdf.RecentDelays))
# rd.columns=["Delay_1","Delay_2","Delay_3"]
columnName = ["Delay_" +str(i+1) for i in range(0,len(rd.columns))]
rd.columns= columnName
rd

   Delay_1  Delay_2  Delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [23]:
newdf = pd.concat([newdf,rd],axis=1)
newdf

,FlightNumber,RecentDelays,Airline,From,To,Delay_1,Delay_2,Delay_3
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,NaN,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,NaN,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [24]:
newdf.drop("RecentDelays", axis=1,inplace=True)

In [25]:
newdf

,FlightNumber,Airline,From,To,Delay_1,Delay_2,Delay_3
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,NaN,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,NaN,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN